{
    "name": "main",
    "title": "Help",
    "contents": [
        {
            "type": "text",
            "item": [
                "Summer is here and it’s that time of year again. The carnival is in town. You can’t wait to get to the carnival play the midway games, go in the rides, and enjoy the adventure. None of your friends can go to the carnival with you so you decide to go by yourself, hang out and have some fun. When you get there, things seem a little different. All of the games and rides are there, but since you are by yourself, the carnival workers and people seem a little different. You can choose to go in and enjoy the fun, or you can choose to see what other adventures are in store.",
                "",
                "You've made it this far, but just in case...",
                "For menu items, such as on the introduction and settings screens, the up and down arrow keys can be used to switch between menu items. The enter key can then be used to execute the menu item. Alternately, menu items can be executing by clicking on them with the mouse or tapping on them with a touch screen enabled device.",
                "",
                "Reset Game will erase all game progress and inventory items setting them back to default values.",
                "The settings scree is also available from the main game (carnival screen) by pressing the P key.",
                "",
                "Carnival Screen",
                "Hotkeys:",
                "Press 'H' to access the help. (This screen)",
                "Press 'P' to access game settings.",
                "Press 'I' to access the player inventory.",
                "",
                "Player Movement:",
                "Press 'A' or the left arrow to move left.",
                "Press 'D' or the right arrow to move right.",
                "Press 'W' or the up arrow to move up.",
                "Press 'S' or the down arrow to move down.",
                "Use combinations to move in diagonal directions.",
                "",
                "Mouse Movement:",
                "Click in the direction away form the player to move in that direction.",
                ""
            ]
        },
        {
            "type": "image",
            "item": "carnival.jpg"
        },
        {
            "type": "text",
            "item": [
                "",
                "With the mouse, click above the player to move up (1).",
                "Click below to move down (5).",
                "Click left to move left (7).",
                "Click right to move right (3)",
                "Click diagonal to move diagonal direction (2, 4, 6, or 8).",
                ""
            ]
        },
        {
            "type": "image",
            "item": "carnivalAction.jpg"
        },
        {
            "type": "text",
            "item": [
                "",
                "To interact with a park element, just move close to it.",
                "Click below to move down (5).",
                "Click left to move left (7).",
                "Click right to move right (3)",
                "Click diagonal to move diagonal direction (2, 4, 6, or 8).",
                ""
            ]
        },
        {
            "type": "image",
            "item": "story.jpg"
        },
        {
            "type": "text",
            "item": [
                "",
                "To interact with a story:",
                "Press 'S' or the down arrow to select the next response.",
                "Press 'W' or the up arrow to select the previous response.",
                "Press  the enter key to submit your response.",
                "",
                "A story will exit when there are no more responses. Just press the enter key to return to the previous screen.",
                "",
                "Alternately, use the mouse to click on a response to submit it.",
                ""
            ]
        },
        {
            "type": "text",
            "item": [
                "",
                "Bumper Cars Ride",
                "",
                "Hotkeys:",
                "Press 'H' to access the help. (This screen)",
                "",
                "Hitting other cars will score a hit. There will be a minute of play time and the ride will end.",
                "",
                "Player Movement:",
                "Press 'A' or the left arrow to move left.",
                "Press 'D' or the right arrow to move right.",
                "Press 'W' or the up arrow to move forward.",
                "",
                "Mouse Movement:",
                "The car will turn toward the mouse pointer.",
                "Right click to move forward.",
                ""
            ]
        },
        {
            "type": "image",
            "item": "bumpercars.jpg"
        },
        {
            "type": "text",
            "item": [
                "",
                "At the end of the ride, you will earn tickets based on the number of hits.",
                ""
            ]
        },
        {
            "type": "text",
            "item": [
                "",
                "Shooting Gallery Game",
                "",
                "Hotkeys:",
                "Press 'H' to access the help. (This screen)",
                "",
                "Hitting a target will score a hit. The game will end after the 25 shots are used up.",
                "",
                "Player Movement:",
                "Press 'A' or the left arrow to move the corsshairs left.",
                "Press 'D' or the right arrow to move the crosshairs right.",
                "Press 'W' or the up arrow to move the crosshairs up.",
                "Press 'S' or the down arrow to move the crosshairs down.",
                "",
                "Mouse Movement:",
                "The crosshairs will follow the mouse.",
                "Right click to fire the gun.",
                ""
            ]
        },
        {
            "type": "image",
            "item": "shootinggallery.jpg"
        },
        {
            "type": "text",
            "item": [
                "",
                "You will get 2 points for the ducks in the back row. 1 point for other targets.",
                "Based on how well you did, you could win some prizes.",
                ""
            ]
        }
    ]
}